# Campanha de marketing de um banco

http://archive.ics.uci.edu/ml/datasets/Bank+Marketing

https://www.kaggle.com/janiobachmann/bank-marketing-dataset

# Aula 1

In [ ]:
url = 'https://raw.githubusercontent.com/allanspadini/classificacao-banco/main/bank.csv'

In [ ]:
import pandas as pd

In [ ]:
df_banco = pd.read_csv(url)
df_banco.head()

   age         job  marital  education  ... pdays  previous poutcome deposit
0   59      admin.  married  secondary  ...    -1         0  unknown     yes
1   56      admin.  married  secondary  ...    -1         0  unknown     yes
2   41  technician  married  secondary  ...    -1         0  unknown     yes
3   55    services  married  secondary  ...    -1         0  unknown     yes
4   54      admin.  married   tertiary  ...    -1         0  unknown     yes

[5 rows x 17 columns]

# Aula 2

In [ ]:
df_banco.tail()

       age          job  marital  education  ... pdays  previous poutcome deposit
11157   33  blue-collar   single    primary  ...    -1         0  unknown      no
11158   39     services  married  secondary  ...    -1         0  unknown      no
11159   32   technician   single  secondary  ...    -1         0  unknown      no
11160   43   technician  married  secondary  ...   172         5  failure      no
11161   34   technician  married  secondary  ...    -1         0  unknown      no

[5 rows x 17 columns]

In [ ]:
df_banco.describe()

                age       balance  ...         pdays      previous
count  11162.000000  11162.000000  ...  11162.000000  11162.000000
mean      41.231948   1528.538524  ...     51.330407      0.832557
std       11.913369   3225.413326  ...    108.758282      2.292007
min       18.000000  -6847.000000  ...     -1.000000      0.000000
25%       32.000000    122.000000  ...     -1.000000      0.000000
50%       39.000000    550.000000  ...     -1.000000      0.000000
75%       49.000000   1708.000000  ...     20.750000      1.000000
max       95.000000  81204.000000  ...    854.000000     58.000000

[8 rows x 7 columns]

In [ ]:
df_banco['deposit'].value_counts()

no     5873
yes    5289
Name: deposit, dtype: int64

# Aula 3

In [ ]:
y = df_banco['deposit']

In [ ]:
X = df_banco.drop(['deposit'], axis=1)

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
modelo = LogisticRegression()

In [ ]:
#modelo.fit(X,y) Este código está comentado porque produz um erro que tratamos na sequência da aula.

In [ ]:
colunas_x = df_banco.describe().columns

In [ ]:
colunas_x

Index(['age', 'balance', 'day', 'duration', 'campaign', 'pdays', 'previous'], dtype='object')

In [ ]:
X = df_banco[colunas_x]

In [ ]:
X

       age  balance  day  duration  campaign  pdays  previous
0       59     2343    5      1042         1     -1         0
1       56       45    5      1467         1     -1         0
2       41     1270    5      1389         1     -1         0
3       55     2476    5       579         1     -1         0
4       54      184    5       673         2     -1         0
...    ...      ...  ...       ...       ...    ...       ...
11157   33        1   20       257         1     -1         0
11158   39      733   16        83         4     -1         0
11159   32       29   19       156         2     -1         0
11160   43        0    8         9         2    172         5
11161   34        0    9       628         1     -1         0

[11162 rows x 7 columns]

In [ ]:
modelo.fit(X,y)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
X.loc[0]

age           59
balance     2343
day            5
duration    1042
campaign       1
pdays         -1
previous       0
Name: 0, dtype: int64

In [ ]:
modelo.predict(X.loc[:1])

array(['yes', 'yes'], dtype=object)

In [ ]:
modelo.predict(X)

array(['yes', 'yes', 'yes', ..., 'no', 'no', 'yes'], dtype=object)

In [ ]:
modelo.predict(X) == y

0         True
1         True
2         True
3         True
4         True
         ...
11157     True
11158     True
11159     True
11160     True
11161    False
Name: deposit, Length: 11162, dtype: bool

In [ ]:
acuracia = sum(modelo.predict(X) == y) / len(y)
acuracia

0.7400107507615122